In [2]:
import pandas as pd

In [3]:
# Sample DataFrame
data = {
    'date': ['2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02'],
    'city': ['London', 'Paris', 'London', 'Paris'],
    'temperature': [10, 12, 11, 13]
}
df = pd.DataFrame(data)

df

         date    city  temperature
0  2024-01-01  London           10
1  2024-01-01   Paris           12
2  2024-01-02  London           11
3  2024-01-02   Paris           13

In [5]:
# Pivot the DataFrame: dates as rows, cities as columns, temperature as values
df_pivot = df.pivot(index='date', columns='city', values='temperature')
df_pivot

city        London  Paris
date
2024-01-01      10     12
2024-01-02      11     13

In [6]:
df_pivot.columns

Index(['London', 'Paris'], dtype='object', name='city')

In [12]:
df_pivot.index

Index(['2024-01-01', '2024-01-02'], dtype='object', name='date')

In [8]:
df_pivot.reset_index()

city        date  London  Paris
0     2024-01-01      10     12
1     2024-01-02      11     13

In [ ]:
df_unpivot = df_pivot.reset_index().melt(id_vars='date', var_name='city', value_name='temperature')
df_unpivot

         date    city  temperature
0  2024-01-01  London           10
1  2024-01-02  London           11
2  2024-01-01   Paris           12
3  2024-01-02   Paris           13

: